In [4]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [9]:
dframe= DataFrame(np.arange(12).reshape(3,4),index=['NY','LA','SF'],
                columns=['A','B','C','D'])
dframe

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [21]:
# changing items to lower case
dframe.index.map(str.lower)

Index(['new york', 'la', 'sf'], dtype='object')

In [22]:
dframe.columns.map(str.lower)

Index(['a', 'b', 'c', 'd'], dtype='object')

In [12]:
# Applying the same to index permenantly
dframe.index= dframe.index.map(str.lower)
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [23]:
# changing  rows
dframe.rename(index=str.title,columns=str.lower)

# str.tile   function will change  first letter of index to upper case

          a  b   c   d
New York  0  1   2   3
La        4  5   6   7
Sf        8  9  10  11

In [25]:
dframe.rename(index=str.title)

          A  B   C   D
New York  0  1   2   3
La        4  5   6   7
Sf        8  9  10  11

In [15]:
# Changing name of Rows by creating new  dictionary

In [16]:
dframe.rename(index={'ny':'New Yourk'},
             columns={'A':'Alpha'})

           Alpha  B   C   D
New Yourk      0  1   2   3
la             4  5   6   7
sf             8  9  10  11

In [17]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [20]:
# to make the  changes permanent
dframe.rename(index={'ny':"New York"},inplace=True)
dframe

          A  B   C   D
New York  0  1   2   3
la        4  5   6   7
sf        8  9  10  11